Repository: obadadallo95/sada-messenger
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Sada
ar: صدى

source: Hello
ar: مرحباً

# welcomeMessage
source: Welcome to Sada Foundation Layer
ar: مرحباً بك في طبقة الأساس لتطبيق صدى

source: Home
ar: الرئيسية

source: Settings
ar: الإعدادات

source: Theme
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: تلقائي

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Chat
ar: الدردشة

source: Coming Soon
ar: قريباً

# foundationLayer
source: Foundation Layer - UI/UX Architecture
ar: طبقة الأساس - هندسة واجهة المستخدم

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Get Started
ar: ابدأ

# onboardingSlide1Title
source: Connect Without Limits
ar: تواصل بلا حدود

# onboardingSlide1Description
source: Connect with your loved ones even when the internet is down through Mesh network.
ar: تواصل مع أحبابك حتى عند انقطاع الإنترنت عبر شبكة Mesh.

# onboardingSlide2Title
source: Absolute Security
ar: أمان مطلق

# onboardingSlide2Description
source: Full encryption for your messages. No central servers, no tracking.
ar: تشفير كامل لرسائلك. لا خوادم مركزية، لا تعقب.

# onboardingSlide3Title
source: Made for Us
ar: صنع لأجلنا

# onboardingSlide3Description
source: Open source app, free, and designed for the Syrian reality.
ar: تطبيق مفتوح المصدر، مجاني، ومصمم للواقع السوري.

source: No chats
ar: لا توجد محادثات

source: Error loading chats
ar: حدث خطأ في تحميل المحادثات

source: Search feature coming soon
ar: ميزة البحث قريباً

source: Online
ar: متصل الآن

# noMessages
source: No messages yet
ar: لا توجد رسائل بعد

source: Error loading messages
ar: حدث خطأ في تحميل الرسائل

# typeMessage
source: Type a message...
ar: اكتب رسالة...

source: Yesterday
ar: أمس

# daysAgo
source: {count} days ago
ar: {count} أيام

source: Scan
ar: مسح

source: User ID
ar: معرف المستخدم

source: Simulate Message
ar: محاكاة رسالة

# simulatingMessage
source: Simulating...
ar: جاري المحاكاة...

# newMessageFrom
source: New message from {name}
ar: رسالة جديدة من {name}

# notificationPermissionRequired
source: We need notification permission to show alerts
ar: نحتاج إلى صلاحية الإشعارات لعرض التنبيهات

source: Power Usage
ar: استهلاك البطارية

source: Disable Battery Optimization
ar: إلغاء تحسين البطارية

# batteryOptimizationDescription
source: To ensure Sada works in the background, please disable battery optimization from system settings
ar: لضمان عمل Sada في الخلفية، يرجى إلغاء تحسين البطارية من إعدادات النظام

source: Could not open settings
ar: تعذر فتح الإعدادات

# serviceActive
source: Sada is active
ar: Sada نشط

# serviceScanning
source: Sada: Scanning...
ar: Sada: جاري المسح...

# serviceSleeping
source: Sada: Sleeping
ar: Sada: نائم

source: Appearance
ar: المظهر

source: Performance
ar: الأداء

# aboutAndLegal
source: About & Legal
ar: حول التطبيق

source: About Us
ar: حولنا

source: Privacy Policy
ar: سياسة الخصوصية

source: Open Source Licenses
ar: تراخيص مفتوحة المصدر

source: Version
ar: الإصدار

# aboutDescription
source: Sada is an open-source, free, offline mesh messaging application designed for the Syrian reality. It enables communication even when the internet is cut off through a wireless Mesh network.
ar: Sada هو تطبيق مراسلة شبكة Mesh مفتوح المصدر، مجاني، ومصمم للواقع السوري. يتيح التواصل حتى عند انقطاع الإنترنت عبر شبكة Mesh لاسلكية.

source: Website
ar: الموقع

# madeWithLove
source: Made with ❤️ for Syria
ar: صُنع بـ ❤️ من أجل سوريا

# lastUpdated
source: Last updated: January 2024
ar: آخر تحديث: يناير 2024

source: No Data Collection
ar: لا جمع للبيانات

# noDataCollectionDescription
source: We do not collect or store any personal data on our servers. All data remains local on your device only.
ar: نحن لا نجمع أو نخزن أي بيانات شخصية على خوادمنا. جميع البيانات تبقى محلية على جهازك فقط.

source: Local Storage
ar: التخزين المحلي

# localStorageDescription
source: All your messages and conversations are stored locally on your device. No data is sent to external servers.
ar: جميع رسائلك ومحادثاتك مخزنة محلياً على جهازك. لا يتم إرسال أي بيانات إلى خوادم خارجية.

source: Encryption
ar: التشفير

# encryptionDescription
source: All messages are end-to-end encrypted (E2E). Even if messages are intercepted, they cannot be read without the private keys.
ar: جميع الرسائل مشفرة من طرف إلى طرف (E2E). حتى لو تم اعتراض الرسائل، لا يمكن قراءتها بدون المفاتيح الخاصة.

source: Mesh Networking
ar: شبكة Mesh

# meshNetworkingDescription
source: Sada uses Mesh Networking technology to communicate directly between devices without the need for central servers or internet connection.
ar: Sada يستخدم تقنية Mesh Networking للتواصل مباشرة بين الأجهزة بدون الحاجة لخوادم مركزية أو اتصال بالإنترنت.

source: Open Source
ar: مفتوح المصدر

# openSourceDescription
source: Sada is an open-source project. You can review the source code on GitHub and contribute to its development.
ar: Sada هو مشروع مفتوح المصدر. يمكنك مراجعة الكود المصدري على GitHub والمساهمة في تطويره.

# exitMessage
source: Press back again to exit
ar: اضغط مرة أخرى للخروج

# createIdentity
source: Create Your Identity
ar: أنشئ هويتك

# identityInfo
source: Your identity is generated from this device's unique signature. No phone number required.
ar: يتم توليد هويتك من التوقيع الفريد لهذا الجهاز. لا حاجة لرقم هاتف.

source: Nickname
ar: الاسم المستعار

# nicknameHint
source: Enter your nickname
ar: أدخل اسمك المستعار

# nicknameRequired
source: Nickname is required
ar: الاسم المستعار مطلوب

# nicknameTooShort
source: Nickname is too short (must be at least 2 characters)
ar: الاسم المستعار قصير جداً (يجب أن يكون حرفين على الأقل)

source: Enter Sada
ar: دخول Sada

# securityNote
source: Your identity is bound to this device only. No data is sent to external servers.
ar: هويتك مرتبطة بهذا الجهاز فقط. لا يتم إرسال أي بيانات إلى خوادم خارجية.

# registrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.

# privacyAndSecurity
source: Privacy & Security
ar: الخصوصية والأمان

source: App Lock
ar: قفل التطبيق

# appLockDescription
source: Require fingerprint to open
ar: طلب البصمة عند فتح التطبيق

source: Sada is Locked
ar: تطبيق صدى مقفل

# unlockToContinue
source: Use your fingerprint to unlock the app
ar: استخدم البصمة لفتح التطبيق

source: Unlock
ar: افتح القفل

# scanFingerprintToEnter
source: Scan your fingerprint to enter Sada
ar: امسح بصمتك للدخول إلى Sada

source: Authentication failed
ar: فشلت المصادقة

# biometricNotAvailable
source: Biometric authentication is not available on this device
ar: البصمة غير متاحة على هذا الجهاز

# failedToChangeLock
source: Failed to change lock status
ar: فشل تغيير حالة القفل

source: Create Community
ar: إنشاء مجتمع

source: Group Name
ar: اسم المجموعة

# groupNameHint
source: Enter group name
ar: أدخل اسم المجموعة

# groupNameRequired
source: Group name is required
ar: اسم المجموعة مطلوب

# groupNameTooShort
source: Group name is too short
ar: اسم المجموعة قصير جداً (يجب أن يكون 3 أحرف على الأقل)

# groupDescription
source: Description
ar: وصف المجموعة

# groupDescriptionHint
source: Enter group description
ar: أدخل وصفاً للمجموعة

# groupDescriptionRequired
source: Description is required
ar: وصف المجموعة مطلوب

source: Public Group
ar: مجموعة عامة

# publicGroupDescription
source: Visible to everyone nearby
ar: يمكن لأي شخص في المنطقة اكتشاف المجموعة والانضمام إليها

# privateGroupDescription
source: Requires password to join
ar: المجموعة خاصة وتتطلب كلمة مرور للانضمام

# groupPassword
source: Password
ar: كلمة المرور

# groupPasswordHint
source: Enter password
ar: أدخل كلمة المرور

# groupPasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة للمجموعات الخاصة

source: Launch Group
ar: إطلاق المجموعة

source: My Groups
ar: مجموعاتي

source: Nearby Communities
ar: المجتمعات القريبة

# peersNearby
source: {count} peers nearby
ar: {count} أقران قريبين

source: Join
ar: انضم

source: Scanning...
ar: جارٍ المسح...

source: Enter PIN
ar: أدخل PIN

source: Change Master PIN
ar: تغيير Master PIN

source: Set Duress PIN
ar: تعيين Duress PIN

# duressPinWarning
source: Use this PIN only in danger. It will hide your real data and show fake data.
ar: استخدم هذا PIN فقط في حالة الخطر. سيخفي بياناتك الحقيقية ويعرض بيانات وهمية.

source: Enter Master PIN
ar: أدخل Master PIN

source: Enter Duress PIN
ar: أدخل Duress PIN

source: Confirm PIN
ar: تأكيد PIN

source: PIN mismatch
ar: PIN غير متطابق

source: PIN set successfully
ar: تم تعيين PIN بنجاح

source: PIN changed successfully
ar: تم تغيير PIN بنجاح

source: Your Identity
ar: هويتك

# yourIdentityDescription
source: Tap to view your QR code and profile
ar: اضغط لعرض رمز QR الخاص بك والملف الشخصي

source: Start Connecting
ar: ابدأ الاتصال

# startConnectingDescription
source: Tap here to search for nearby devices or create a group
ar: اضغط هنا للبحث عن الأجهزة القريبة أو إنشاء مجموعة

source: Lead Developer
ar: المطور الرئيسي

source: Founder
ar: المؤسس

source: Share App Offline
ar: شارك التطبيق

# shareAppOfflineDescription
source: Send APK file via Bluetooth or sharing apps
ar: إرسال ملف APK عبر البلوتوث أو تطبيقات المشاركة

# preparingApk
source: Preparing APK file...
ar: جاري تحضير ملف APK...

# apkShareSuccess
source: Share sheet opened successfully
ar: تم فتح شاشة المشاركة بنجاح

# apkShareError
source: Failed to share APK file
ar: فشل مشاركة ملف APK

source: Notifications
ar: الإشعارات

source: No notifications
ar: لا توجد إشعارات

source: Mark all as read
ar: تعليم الكل كمقروء

source: No Internet? No Problem.
ar: لا إنترنت؟ لا مشكلة.

# noInternetDescription
source: Sada works when the internet doesn't. Connect directly with people around you using WiFi Direct.
ar: يعمل صدى عندما ينقطع الإنترنت. تواصل مباشرة مع من حولك باستخدام WiFi Direct.

source: You Are The Network
ar: أنت الشبكة

# youAreTheNetworkDescription
source: Your phone acts as a bridge. Help your community stay connected just by keeping the app open.
ar: هاتفك يعمل كجسر. ساعد مجتمعك على البقاء متصلاً بمجرد إبقاء التطبيق مفتوحاً.

# invisibleAndSecure
source: Invisible & Secure
ar: غير مرئي وآمن

# invisibleAndSecureDescription
source: No servers. No tracking. Your messages stay in your neighborhood.
ar: لا خوادم. لا تعقب. رسائلك تبقى في حيّك.

source: Ready to Connect?
ar: جاهز للاتصال؟

# readyToConnectDescription
source: Grant permissions to start discovering people nearby.
ar: امنح الصلاحيات للبدء باكتشاف الأشخاص القريبين.

# permissionLocation
source: Location
ar: الموقع

# permissionNotify
source: Notify
ar: إشعارات

source: Zero-Knowledge Promise
ar: وعد المعرفة الصفرية

source: No Phone Number Required
ar: لا حاجة لرقم هاتف

# noPhoneNumberDescription
source: We don't ask for your phone number, email, or real identity. You are just a cryptographic key pair.
ar: لا نطلب رقم هاتفك أو بريدك الإلكتروني. أنت مجرد مفتاح تشفير.

# endToEndEncryptionDescription
source: All messages are encrypted on your device and only decrypted by the recipient. We cannot read your chats.
ar: جميع الرسائل مشفرة على جهازك ويتم فك تشفيرها فقط عند المستلم.

source: Local Database Only
ar: قاعدة بيانات محلية فقط

# localDatabaseDescription
source: Your data lives on your phone. There is no cloud backup. If you delete the app, your data is gone forever.
ar: بياناتك تعيش على هاتفك. لا يوجد نسخ احتياطي سحابي. إذا حذفت التطبيق، ستضيع بياناتك للأبد.

source: Transparency
ar: الشفافية

# transparencyDescription
source: Sada uses standard WiFi Direct and UDP broadcasts to find peers. While your device announces its presence, your real identity remains hidden behind a random ID.
ar: يستخدم صدى تقنيات قياسية مثل WiFi Direct و UDP. بينما يعلن جهازك عن وجوده، تبقى هويتك الحقيقية مخفية.

source: View Source Code
ar: عرض الكود المصدري

source: How it Works
ar: كيف يعمل

# scanQrDescription
source: Meet a friend and scan their QR code to swap keys securely.
ar: قابل صديقاً وامسح رمزه لتبادل المفاتيح بأمان.

source: Auto Connect
ar: اتصال تلقائي

# autoConnectDescription
source: Your devices automatically find each other over WiFi Direct.
ar: تجد أجهزتكم بعضها تلقائياً عبر WiFi Direct.

source: Secure Chat
ar: محادثة آمنة

# secureChatDescription
source: Messages hop between devices until they reach the destination.
ar: تنتقل الرسائل بين الأجهزة حتى تصل لوجهتها.

source: Designed for Resilience
ar: صُمم للصمود

# shareQrCodeDescription
source: Share this QR code to add you as a contact
ar: شارك هذا الرمز لإضافتك كجهة اتصال

# qrCodeSecurityInfo
source: This QR code contains your public key for secure messaging.
ar: يحتوي هذا الرمز على مفتاحك العام للمراسلة الآمنة.

# navigation_home
source: Home
ar: الرئيسية

# navigation_chat
source: Chats
ar: الدردشة

# navigation_communities
source: Communities
ar: المجتمعات

# navigation_add
source: Add
ar: إضافة

# navigation_settings
source: Settings
ar: الإعدادات

# home_title
source: Local Network
ar: الشبكة المحلية

# home_status_connected
source: Connected
ar: متصل

# home_status_connecting
source: Connecting...
ar: جاري الاتصال...

# home_status_offline
source: Offline
ar: غير متصل

# home_peers_count
source: {count} devices connected
ar: {count} جهاز متصل

# home_empty_title
source: Your Network is Ready
ar: شبكتك جاهزة

# home_empty_subtitle
source: Wait for nearby devices or start a new conversation
ar: انتظر اتصال الأجهزة المجاورة أو ابدأ محادثة جديدة

# home_empty_action
source: Start Chat
ar: بدء محادثة

# chat_empty_title
source: No Conversations
ar: لا توجد محادثات

# chat_empty_subtitle
source: Start a secure, encrypted conversation with your friends
ar: ابدأ محادثة آمنة ومشفرة مع أصدقائك

# chat_empty_action
source: Add Friend
ar: إضافة صديق

# communities_empty_title
source: No Communities
ar: لا توجد مجتمعات

# communities_empty_subtitle
source: Discover groups in your area or create a new community
ar: اكتشف مجموعات في منطقتك أو أنشئ مجتمعاً جديداً

# communities_empty_action
source: Create Community
ar: إنشاء مجتمع

# communities_create_button
source: New Community
ar: مجتمع جديد

# qr_title
source: Share Code
ar: رمز المشاركة

# qr_my_code
source: My Code
ar: رمزي الشخصي

# qr_scan
source: Scan Code
ar: مسح رمز

# qr_share_title
source: Share via
ar: مشاركة عبر

# qr_copy_id
source: Copy ID
ar: نسخ المعرف

# qr_copied
source: Copied
ar: تم النسخ

# qr_hint
source: Scan to add me as a friend
ar: امسح الرمز لإضافتي كصديق

# qr_user_id_label
source: ID:
ar: المعرف:

# settings_profile
source: Profile
ar: الملف الشخصي

# settings_appearance
source: Appearance
ar: المظهر

# settings_theme_light
source: Light
ar: فاتح

# settings_theme_dark
source: Dark
ar: داكن

# settings_theme_system
source: System
ar: تلقائي

# settings_language
source: Language
ar: اللغة

# settings_security
source: Security
ar: الأمان

# settings_biometric
source: Biometric Lock
ar: القفل البيومتري

# settings_network
source: Network
ar: الشبكة

# settings_power_mode
source: Power Mode
ar: وضع الطاقة

# settings_power_high
source: High Performance
ar: أداء عالي

# settings_power_balanced
source: Balanced
ar: متوازن

# settings_power_low
source: Power Saving
ar: موفر للطاقة

# common_cancel
source: Cancel
ar: إلغاء

# common_save
source: Save
ar: حفظ

# common_delete
source: Delete
ar: حذف

# common_edit
source: Edit
ar: تعديل

# common_done
source: Done
ar: تم

# common_close
source: Close
ar: إغلاق

# common_loading
source: Loading...
ar: جاري التحميل...

# common_error
source: Error occurred
ar: حدث خطأ

# common_retry
source: Retry
ar: إعادة المحاولة

# common_search
source: Search
ar: بحث

# common_send
source: Send
ar: إرسال

source: Terms of Service
ar: شروط الاستخدام
